#primitive Data Type
#Number , Boolean , string

# non-primitive Data type / coiiiection / Date structure ข้อมูลชนิดไม่พื้นฐาน
#List , tuple ,set ,Dictionary

#Data Type จะเอามาใช้กับการเขียนโปรแกรมในเรื่องของ ตัวแปร พารามิเตอร์ ฟังก์ชัน เมธอด

#-------------------List คือ ข้อมูลหลายข้อมูล คนละชนิด ซ้ำกันได้ และมีลำดับ อีกทั้งแก้ไขได้ด้วย------------------------------
        #   0   1   2   3   4   5   
my_list1 = [10,20,True,10,'SAU', [20, 'IOT']]
        #   6   5   4   3   2           1   คิด-

#-------------------Tuple คือ ข้อมูลหลายข้อมูล คนละชนิด ซ้ำกันได้ และมีลำดับ อีกทั้งแก้ไขไม่ได้--------------------------------
        #   0   1   2   3   4   5   
my_Tuple1 = [10,20,True,10,'SAU', (20, 'IOT')]
        #   6   5   4   3   2           1   คิด-
#-----------Set คือ ข้อมูลหลายข้อมูล คนละชนิด ซ้ำกันไม่ได้(หากซ้ำถือว่าเป็นตัวเดียวกัน) และไม่มีลำดับ อีกทั้งแก้ไขไม่ได้ เพิ่ม ลบได้----------------
my_Set = {10,20,True,10,'SAU', (20, 'IOT')}
#-----------Dictionary คือ ข้อมูลหลายข้อมูล ที่เป็น kye:value แก้ไขได้ด้วย ไม่มีลำดับ ซ้ำได้-----------------------------------
#kye เป็น string / lnteger ส่วน value เป็นอะไรก็ได้(number,str,Boo,list,tuple,set,dictoanary)
my_Dictionary = {'name':'mod', 'age':30 , 555:999, 'flag':True, 'wow':[10,20,30]}